{
  "backend/main.mo": "Motoko backend handling user profiles and contact form submissions with admin/user authorization and sortable retrieval.",
  "feature_evidence.json": "Feature evidence report listing files and components involved in adding and displaying a CSC ID across the site.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all major frontend pages, components, content modules, and configuration files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and global element styling.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, and the root element for the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for Home, About, Services, and Contact pages.",
  "frontend/src/components/ContactForm.tsx": "React contact form with validation, submission via React Query, and success/error alert states.",
  "frontend/src/components/MapEmbed.tsx": "Google Maps iframe embed displaying the business address from centralized business info.",
  "frontend/src/components/ServiceCard.tsx": "UI card component rendering a service with icon, title, and description.",
  "frontend/src/components/ServiceIcon.tsx": "Maps string icon identifiers to Lucide React icons for service display.",
  "frontend/src/components/SiteFooter.tsx": "Footer showing business info including phone, address, VLE, and CSC ID with navigation and WhatsApp link.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation links, phone CTA, and mobile menu toggle.",
  "frontend/src/components/SiteLayout.tsx": "Wraps pages with header, footer, and WhatsApp button, providing a full-page layout.",
  "frontend/src/components/WhatsAppFloatingButton.tsx": "Floating WhatsApp contact button linking to the business WhatsApp number.",
  "frontend/src/content/business.ts": "Exports basic business details including name, owner, phone, WhatsApp number, and address.",
  "frontend/src/content/services.ts": "Defines service interface and a list of service entries with titles, descriptions, and icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and helpers for login, logout, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Defines a contact form submission mutation using the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables for light/dark themes and utility extensions.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero section, business description, and values cards.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with a hero section, business contact details, cards, and a contact form plus map embed.",
  "frontend/src/pages/HomePage.tsx": "Defines the Home page with a hero, CTA buttons, and a features section highlighting service benefits.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a hero section and a grid of ServiceCard components populated from the services content list.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, containers, radii, animations, and theme settings for the project.",
  "project_state.json": "Project metadata describing site requirements, implemented features, branding rules, and architectural notes."
}